MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MCXC141VLH/mcu.h
#define USB0_PERID                    (*((volatile uint32_t *)0x40072000))      // Peripheral ID register
#define USB0_IDCOMP                   (*((volatile uint32_t *)0x40072004))      // Peripheral ID Complement register
#define USB0_REV                      (*((volatile uint32_t *)0x40072008))      // Peripheral Revision register
#define USB0_ADDINFO                  (*((volatile uint32_t *)0x4007200C))      // Peripheral Additional Info register
#define USB0_ISTAT                    (*((volatile uint32_t *)0x40072080))      // Interrupt Status register
#define USB0_INTEN                    (*((volatile uint32_t *)0x40072084))      // Interrupt Enable register
#define USB0_ERRSTAT                  (*((volatile uint32_t *)0x40072088))      // Error Interrupt Status register
#define USB0_ERREN                    (*((volatile uint32_t *)0x4007208C))      // Error Interrupt Enable register
#define USB0_STAT                     (*((volatile uint32_t *)0x40072090))      // Status register
#define USB0_CTL                      (*((volatile uint32_t *)0x40072094))      // Control register
#define USB0_ADDR                     (*((volatile uint32_t *)0x40072098))      // Address register
#define USB0_BDTPAGE1                 (*((volatile uint32_t *)0x4007209C))      // BDT Page register 1
#define USB0_FRMNUML                  (*((volatile uint32_t *)0x400720A0))      // Frame Number register Low
#define USB0_FRMNUMH                  (*((volatile uint32_t *)0x400720A4))      // Frame Number register High
#define USB0_BDTPAGE2                 (*((volatile uint32_t *)0x400720B0))      // BDT Page Register 2
#define USB0_BDTPAGE3                 (*((volatile uint32_t *)0x400720B4))      // BDT Page Register 3
#define USB0_ENDPT0                   (*((volatile uint32_t *)0x400720C0))      // Endpoint Control register
#define USB0_ENDPT1                   (*((volatile uint32_t *)0x400720C4))      // Endpoint Control register
#define USB0_ENDPT2                   (*((volatile uint32_t *)0x400720C8))      // Endpoint Control register
#define USB0_ENDPT3                   (*((volatile uint32_t *)0x400720CC))      // Endpoint Control register
#define USB0_ENDPT4                   (*((volatile uint32_t *)0x400720D0))      // Endpoint Control register
#define USB0_ENDPT5                   (*((volatile uint32_t *)0x400720D4))      // Endpoint Control register
#define USB0_ENDPT6                   (*((volatile uint32_t *)0x400720D8))      // Endpoint Control register
#define USB0_ENDPT7                   (*((volatile uint32_t *)0x400720DC))      // Endpoint Control register
#define USB0_ENDPT8                   (*((volatile uint32_t *)0x400720E0))      // Endpoint Control register
#define USB0_ENDPT9                   (*((volatile uint32_t *)0x400720E4))      // Endpoint Control register
#define USB0_ENDPT10                  (*((volatile uint32_t *)0x400720E8))      // Endpoint Control register
#define USB0_ENDPT11                  (*((volatile uint32_t *)0x400720EC))      // Endpoint Control register
#define USB0_ENDPT12                  (*((volatile uint32_t *)0x400720F0))      // Endpoint Control register
#define USB0_ENDPT13                  (*((volatile uint32_t *)0x400720F4))      // Endpoint Control register
#define USB0_ENDPT14                  (*((volatile uint32_t *)0x400720F8))      // Endpoint Control register
#define USB0_ENDPT15                  (*((volatile uint32_t *)0x400720FC))      // Endpoint Control register
#define USB0_USBCTRL                  (*((volatile uint32_t *)0x40072100))      // USB Control register
#define USB0_OBSERVE                  (*((volatile uint32_t *)0x40072104))      // USB OTG Observe register
#define USB0_CONTROL                  (*((volatile uint32_t *)0x40072108))      // USB OTG Control register
#define USB0_USBTRC0                  (*((volatile uint32_t *)0x4007210C))      // USB Transceiver Control register 0
#define USB0_USBFRMADJUST             (*((volatile uint32_t *)0x40072114))      // Frame Adjust Register
#define USB0_KEEP_ALIVE_CTRL          (*((volatile uint32_t *)0x40072124))      // Keep Alive mode control
#define USB0_KEEP_ALIVE_WKCTRL        (*((volatile uint32_t *)0x40072128))      // Keep Alive mode wakeup control
#define USB0_CLK_RECOVER_CTRL         (*((volatile uint32_t *)0x40072140))      // USB Clock recovery control
#define USB0_CLK_RECOVER_IRC_EN       (*((volatile uint32_t *)0x40072144))      // IRC48M oscillator enable register
#define USB0_CLK_RECOVER_INT_EN       (*((volatile uint32_t *)0x40072154))      // Clock recovery combined interrupt enable
#define USB0_CLK_RECOVER_INT_STATUS   (*((volatile uint32_t *)0x4007215C))      // Clock recovery separated interrupt status


//*****************************************************************************
//
// FlexIO registers
//
//*****************************************************************************

#define FLEXIO_VERID                  (*((volatile uint32_t *)0x4005F000))      // Version ID Register
#define FLEXIO_PARAM                  (*((volatile uint32_t *)0x4005F004))      // Parameter Register
#define FLEXIO_CTRL                   (*((volatile uint32_t *)0x4005F008))      // FlexIO Control Register
#define FLEXIO_SHIFTSTAT              (*((volatile uint32_t *)0x4005F010))      // Shifter Status Register
#define FLEXIO_SHIFTERR               (*((volatile uint32_t *)0x4005F014))      // Shifter Error Register
#define FLEXIO_TIMSTAT                (*((volatile uint32_t *)0x4005F018))      // Timer Status Register
#define FLEXIO_SHIFTSIEN              (*((volatile uint32_t *)0x4005F020))      // Shifter Status Interrupt Enable
#define FLEXIO_SHIFTEIEN              (*((volatile uint32_t *)0x4005F024))      // Shifter Error Interrupt Enable
#define FLEXIO_TIMIEN                 (*((volatile uint32_t *)0x4005F028))      // Timer Interrupt Enable Register
#define FLEXIO_SHIFTSDEN              (*((volatile uint32_t *)0x4005F030))      // Shifter Status DMA Enable
#define FLEXIO_SHIFTCTL0              (*((volatile uint32_t *)0x4005F080))      // Shifter Control N Register
#define FLEXIO_SHIFTCTL1              (*((volatile uint32_t *)0x4005F084))      // Shifter Control N Register
#define FLEXIO_SHIFTCTL2              (*((volatile uint32_t *)0x4005F088))      // Shifter Control N Register
#define FLEXIO_SHIFTCTL3              (*((volatile uint32_t *)0x4005F08C))      // Shifter Control N Register
#define FLEXIO_SHIFTCFG0              (*((volatile uint32_t *)0x4005F100))      // Shifter Configuration N Register
#define FLEXIO_SHIFTCFG1              (*((volatile uint32_t *)0x4005F104))      // Shifter Configuration N Register
#define FLEXIO_SHIFTCFG2              (*((volatile uint32_t *)0x4005F108))      // Shifter Configuration N Register
#define FLEXIO_SHIFTCFG3              (*((volatile uint32_t *)0x4005F10C))      // Shifter Configuration N Register
#define FLEXIO_SHIFTBUF0              (*((volatile uint32_t *)0x4005F200))      // Shifter Buffer N Register
#define FLEXIO_SHIFTBUF1              (*((volatile uint32_t *)0x4005F204))      // Shifter Buffer N Register
#define FLEXIO_SHIFTBUF2              (*((volatile uint32_t *)0x4005F208))      // Shifter Buffer N Register
#define FLEXIO_SHIFTBUF3              (*((volatile uint32_t *)0x4005F20C))      // Shifter Buffer N Register
#define FLEXIO_SHIFTBUFBIS0           (*((volatile uint32_t *)0x4005F280))      // Shifter Buffer N Bit Swapped Register
#define FLEXIO_SHIFTBUFBIS1           (*((volatile uint32_t *)0x4005F284))      // Shifter Buffer N Bit Swapped Register
#define FLEXIO_SHIFTBUFBIS2           (*((volatile uint32_t *)0x4005F288))      // Shifter Buffer N Bit Swapped Register
#define FLEXIO_SHIFTBUFBIS3           (*((volatile uint32_t *)0x4005F28C))      // Shifter Buffer N Bit Swapped Register
#define FLEXIO_SHIFTBUFBYS0           (*((volatile uint32_t *)0x4005F300))      // Shifter Buffer N Byte Swapped Register
#define FLEXIO_SHIFTBUFBYS1           (*((volatile uint32_t *)0x4005F304))      // Shifter Buffer N Byte Swapped Register
#define FLEXIO_SHIFTBUFBYS2           (*((volatile uint32_t *)0x4005F308))      // Shifter Buffer N Byte Swapped Register
#define FLEXIO_SHIFTBUFBYS3           (*((volatile uint32_t *)0x4005F30C))      // Shifter Buffer N Byte Swapped Register
#define FLEXIO_SHIFTBUFBBS0           (*((volatile uint32_t *)0x4005F380))      // Shifter Buffer N Bit Byte Swapped Register
#define FLEXIO_SHIFTBUFBBS1           (*((volatile uint32_t *)0x4005F384))      // Shifter Buffer N Bit Byte Swapped Register
#define FLEXIO_SHIFTBUFBBS2           (*((volatile uint32_t *)0x4005F388))      // Shifter Buffer N Bit Byte Swapped Register
#define FLEXIO_SHIFTBUFBBS3           (*((volatile uint32_t *)0x4005F38C))      // Shifter Buffer N Bit Byte Swapped Register
#define FLEXIO_TIMCTL0                (*((volatile uint32_t *)0x4005F400))      // Timer Control N Register
#define FLEXIO_TIMCTL1                (*((volatile uint32_t *)0x4005F404))      // Timer Control N Register
#define FLEXIO_TIMCTL2                (*((volatile uint32_t *)0x4005F408))      // Timer Control N Register
#define FLEXIO_TIMCTL3                (*((volatile uint32_t *)0x4005F40C))      // Timer Control N Register
#define FLEXIO_TIMCFG0                (*((volatile uint32_t *)0x4005F480))      // Timer Configuration N Register
#define FLEXIO_TIMCFG1                (*((volatile uint32_t *)0x4005F484))      // Timer Configuration N Register
#define FLEXIO_TIMCFG2                (*((volatile uint32_t *)0x4005F488))      // Timer Configuration N Register
#define FLEXIO_TIMCFG3                (*((volatile uint32_t *)0x4005F48C))      // Timer Configuration N Register
#define FLEXIO_TIMCMP0                (*((volatile uint32_t *)0x4005F500))      // Timer Compare N Register
#define FLEXIO_TIMCMP1                (*((volatile uint32_t *)0x4005F504))      // Timer Compare N Register
#define FLEXIO_TIMCMP2                (*((volatile uint32_t *)0x4005F508))      // Timer Compare N Register
#define FLEXIO_TIMCMP3                (*((volatile uint32_t *)0x4005F50C))      // Timer Compare N Register


//*****************************************************************************
//
// General-Purpose Input/Output (GPIO) registers
//
//*****************************************************************************

#define GPIOA_PDOR                    (*((volatile uint32_t *)0x400FF000))      // Port Data Output Register
#define GPIOA_PSOR                    (*((volatile uint32_t *)0x400FF004))      // Port Set Output Register
#define GPIOA_PCOR                    (*((volatile uint32_t *)0x400FF008))      // Port Clear Output Register
#define GPIOA_PTOR                    (*((volatile uint32_t *)0x400FF00C))      // Port Toggle Output Register
#define GPIOA_PDIR                    (*((volatile uint32_t *)0x400FF010))      // Port Data Input Register
#define GPIOA_PDDR                    (*((volatile uint32_t *)0x400FF014))      // Port Data Direction Register
#define GPIOB_PDOR                    (*((volatile uint32_t *)0x400FF040))      // Port Data Output Register
#define GPIOB_PSOR                    (*((volatile uint32_t *)0x400FF044))      // Port Set Output Register
#define GPIOB_PCOR                    (*((volatile uint32_t *)0x400FF048))      // Port Clear Output Register
#define GPIOB_PTOR                    (*((volatile uint32_t *)0x400FF04C))      // Port Toggle Output Register
#define GPIOB_PDIR                    (*((volatile uint32_t *)0x400FF050))      // Port Data Input Register
#define GPIOB_PDDR                    (*((volatile uint32_t *)0x400FF054))      // Port Data Direction Register
#define GPIOC_PDOR                    (*((volatile uint32_t *)0x400FF080))      // Port Data Output Register
#define GPIOC_PSOR                    (*((volatile uint32_t *)0x400FF084))      // Port Set Output Register
#define GPIOC_PCOR                    (*((volatile uint32_t *)0x400FF088))      // Port Clear Output Register
#define GPIOC_PTOR                    (*((volatile uint32_t *)0x400FF08C))      // Port Toggle Output Register
#define GPIOC_PDIR                    (*((volatile uint32_t *)0x400FF090))      // Port Data Input Register
#define GPIOC_PDDR                    (*((volatile uint32_t *)0x400FF094))      // Port Data Direction Register
#define GPIOD_PDOR                    (*((volatile uint32_t *)0x400FF0C0))      // Port Data Output Register
#define GPIOD_PSOR                    (*((volatile uint32_t *)0x400FF0C4))      // Port Set Output Register
#define GPIOD_PCOR                    (*((volatile uint32_t *)0x400FF0C8))      // Port Clear Output Register
#define GPIOD_PTOR                    (*((volatile uint32_t *)0x400FF0CC))      // Port Toggle Output Register
#define GPIOD_PDIR                    (*((volatile uint32_t *)0x400FF0D0))      // Port Data Input Register
#define GPIOD_PDDR                    (*((volatile uint32_t *)0x400FF0D4))      // Port Data Direction Register
#define GPIOE_PDOR                    (*((volatile uint32_t *)0x400FF100))      // Port Data Output Register
#define GPIOE_PSOR                    (*((volatile uint32_t *)0x400FF104))      // Port Set Output Register
#define GPIOE_PCOR                    (*((volatile uint32_t *)0x400FF108))      // Port Clear Output Register
#define GPIOE_PTOR                    (*((volatile uint32_t *)0x400FF10C))      // Port Toggle Output Register
#define GPIOE_PDIR                    (*((volatile uint32_t *)0x400FF110))      // Port Data Input Register
#define GPIOE_PDDR                    (*((volatile uint32_t *)0x400FF114))      // Port Data Direction Register


//*****************************************************************************
//
// Micro Trace Buffer (MTB) registers
//
//*****************************************************************************

#define MTB_POSITION                  (*((volatile uint32_t *)0xF0000000))      // MTB Position Register (MTB_POSITION)
#define MTB_MASTER                    (*((volatile uint32_t *)0xF0000004))      // MTB Master Register (MTB_MASTER)
#define MTB_FLOW                      (*((volatile uint32_t *)0xF0000008))      // MTB Flow Register (MTB_FLOW)
#define MTB_BASE                      (*((volatile uint32_t *)0xF000000C))      // MTB Base Register (MTB_BASE)
#define MTB_MODECTRL                  (*((volatile uint32_t *)0xF0000F00))      // Integration Mode Control Register (MTB_MODECTRL)
#define MTB_TAGSET                    (*((volatile uint32_t *)0xF0000FA0))      // Claim TAG Set Register (MTB_TAGSET)
#define MTB_TAGCLEAR                  (*((volatile uint32_t *)0xF0000FA4))      // Claim TAG Clear Register (MTB_TAGCLEAR)
#define MTB_LOCKACCESS                (*((volatile uint32_t *)0xF0000FB0))      // Lock Access Register (MTB_LOCKACCESS)
#define MTB_LOCKSTAT                  (*((volatile uint32_t *)0xF0000FB4))      // Lock Status Register (MTB_LOCKSTAT)
#define MTB_AUTHSTAT                  (*((volatile uint32_t *)0xF0000FB8))      // Authentication Status Register (MTB_AUTHSTAT)
#define MTB_DEVICEARCH                (*((volatile uint32_t *)0xF0000FBC))      // Device Architecture Register (MTB_DEVICEARCH)
#define MTB_DEVICECFG                 (*((volatile uint32_t *)0xF0000FC8))      // Device Configuration Register (MTB_DEVICECFG)
#define MTB_DEVICETYPID               (*((volatile uint32_t *)0xF0000FCC))      // Device Type Identifier Register (MTB_DEVICETYPID)
#define MTB_PERIPHID4                 (*((volatile uint32_t *)0xF0000FD0))      // Peripheral ID Register (MTB_PERIPHID4)
#define MTB_PERIPHID5                 (*((volatile uint32_t *)0xF0000FD4))      // Peripheral ID Register (MTB_PERIPHID5)
#define MTB_PERIPHID6                 (*((volatile uint32_t *)0xF0000FD8))      // Peripheral ID Register (MTB_PERIPHID6)
#define MTB_PERIPHID7                 (*((volatile uint32_t *)0xF0000FDC))      // Peripheral ID Register (MTB_PERIPHID7)
#define MTB_PERIPHID0                 (*((volatile uint32_t *)0xF0000FE0))      // Peripheral ID Register (MTB_PERIPHID0)
#define MTB_PERIPHID1                 (*((volatile uint32_t *)0xF0000FE4))      // Peripheral ID Register (MTB_PERIPHID1)
#define MTB_PERIPHID2                 (*((volatile uint32_t *)0xF0000FE8))      // Peripheral ID Register (MTB_PERIPHID2)
#define MTB_PERIPHID3                 (*((volatile uint32_t *)0xF0000FEC))      // Peripheral ID Register (MTB_PERIPHID3)
#define MTB_COMPID0                   (*((volatile uint32_t *)0xF0000FF0))      // Component ID Register (MTB_COMPID0)
#define MTB_COMPID1                   (*((volatile uint32_t *)0xF0000FF4))      // Component ID Register (MTB_COMPID1)
#define MTB_COMPID2                   (*((volatile uint32_t *)0xF0000FF8))      // Component ID Register (MTB_COMPID2)
#define MTB_COMPID3                   (*((volatile uint32_t *)0xF0000FFC))      // Component ID Register (MTB_COMPID3)



//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT1 register.
//
//*****************************************************************************

