MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MCXC141VLH/mcu.h
#define CE                            0x40000000      // Configuration Error
#define BES                           0x20000000      // Bus Error on Source
#define BED                           0x10000000      // Bus Error on Destination
#define REQ                           0x04000000      // Request
#define BSY                           0x02000000      // Busy
#define DONE                          0x01000000      // Transactions Done
#define BCR                           0x7FFFFF800000      // This field contains the number of bytes yet to be transferred for a given block.


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_DCRn register.
//
//*****************************************************************************

#define EINT                          0x80000000      // Enable Interrupt on Completion of Transfer
#define ERQ                           0x40000000      // Enable Request
#define CS                            0x20000000      // Cycle Steal
#define AA                            0x10000000      // Auto-allocate
#define Reserved                      0x78000000      // This read-only field is reserved and always has the value 0.
#define EADREQ                        0x00800000      // Enable Asynchronous DMA Request
#define SINC                          0x00400000      // Source Increment
#define SSIZE                         0x00600000      // Source Size
#define DINC                          0x00080000      // Destination Increment
#define DSIZE                         0x000C0000      // Destination Size
#define START                         0x00010000      // Start
#define SMOD                          0x00018000      // Source Mode
#define DMOD                          0x00006000      // Destination Mode
#define D_REQ                         0x00001800      // Destination Request
#define LINKCC                        0x00000600      // Link Channel Control
#define LCH1                          0x00000180      // Linked Channel 1
#define LCH2                          0x00000060      // Linked Channel 2
#define Reserved                      0x00000078      // This read-only field is reserved and always has the value 0.


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_PLASC register.
//
//*****************************************************************************

#define ASC                           0x00007F80      // Each bit in the ASC field indicates whether there is a corresponding connection to the crossbar switch's slave input port.


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_PLAMC register.
//
//*****************************************************************************

#define AMC                           0x00007F80      // Each bit in the AMC field indicates whether there is a corresponding connection to the AXBS master input port.


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_PLACR register.
//
//*****************************************************************************

#define ESFC                          0x00010000      // Enable Stalling Flash Controller
#define DFCS                          0x00008000      // Disable Flash Controller Speculation
#define EFDS                          0x00004000      // Enable Flash Data Speculation
#define DFCC                          0x00002000      // Disable Flash Controller Cache
#define DFCIC                         0x00001000      // Disable Flash Controller Instruction Caching
#define DFCDA                         0x00000800      // Disable Flash Controller Data Caching
#define CFCC                          0x00000400      // Clear Flash Controller Cache
#define ARB                           0x00000200      // Arbitration select


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_CPO register.
//
//*****************************************************************************

#define CPOWOI                        0x00000004      // Compute Operation Wake-up on Interrupt
#define CPOACK                        0x00000002      // Compute Operation Acknowledge
#define CPOREQ                        0x00000001      // Compute Operation Request


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_DATA register.
//
//*****************************************************************************

#define HU                            0x7F80000000      // CRC High Upper Byte
#define HL                            0x7F800000      // CRC High Lower Byte
#define LU                            0x007F8000      // CRC Low Upper Byte
#define LL                            0x00007F80      // CRC Low Lower Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_GPOLY register.
//
//*****************************************************************************

#define HIGH                          0x7FFF80000000      // High Polynominal Half-word
#define LOW                           0x7FFF8000      // Low Polynominal Half-word


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_CTRL register.
//
//*****************************************************************************

#define TOT                           0x04000000      // -
#define TOTR                          0x02000000      // -
#define FXOR                          0x01000000      // -
#define WAS                           0x00800000      // -
#define TCRC                          0x00400000      // -


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_PERID register.
//
//*****************************************************************************

#define ID                            0x00000078      // Peripheral Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_IDCOMP register.
//
//*****************************************************************************

#define NID                           0x00000078      // Ones' complement of PERID[ID] bits


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_REV register.
//
//*****************************************************************************

#define REV                           0x00007F80      // Revision


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ADDINFO register.
//
//*****************************************************************************

#define IEHOST                        0x00000001      // Host mode enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ISTAT register.
//
//*****************************************************************************

#define STALL                         0x00000080      // Stall Interrupt
#define RESUME                        0x00000020      // Resume Interrupt
#define SLEEP                         0x00000010      // Sleep Interrupt
#define TOKDNE                        0x00000008      // Token Done Interrupt
#define SOFTOK                        0x00000004      // Start Of Frame Interrupt
#define ERROR                         0x00000002      // Error Interrupt
#define USBRST                        0x00000001      // USB Reset Interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_INTEN register.
//
//*****************************************************************************

#define STALLEN                       0x00000080      // Stall Interrupt Enable
#define RESUMEEN                      0x00000020      // Resume Interrupt Enable
#define SLEEPEN                       0x00000010      // Sleep Interrupt Enable
#define TOKDNEEN                      0x00000008      // Token Done Interrupt Enable
#define SOFTOKEN                      0x00000004      // Start Of Frame Interrupt Enable
#define ERROREN                       0x00000002      // Error Interrupt Enable
#define USBRSTEN                      0x00000001      // USB Reset Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ERRSTAT register.
//
//*****************************************************************************

